SrvrtsRefDOCMGRDEMO/src/InformationRegisters/ПравилаУчетаВидовЭДДО/ПравилаУчетаВидовЭДДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПравилаУчетаВидовЭДДО</name>
  <resources>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
    </type>
  </resources>
  <resources>
    <name>ВопросДеятельности</name>
    <type>
      <types>CatalogRef.ВопросыДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТребуетсяИзвещениеОПолучении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТребуетсяОтветнаяПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШаблонСодержания</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Принимать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидЭД</name>
    <type>
      <types>EnumRef.ВидыЭД</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЭД</name>
    <type>
      <types>EnumRef.ТипыЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SrvrtsRefDOCMGRDEMO/src/Enums/ВидыЭД/ВидыЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭД</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>АктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>АктОРасхождениях</name>
  </enumValues>
  <enumValues>
    <name>Внутренний</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКоммерческихПредложений</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>ПрикладнойЭД</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйЭД</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиОтправитель</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Продавец</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДопДанные</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКвитанция</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УКД</name>
  </enumValues>
  <enumValues>
    <name>УПД</name>
  </enumValues>
</mdclass:Enum>

SrvrtsRefDOCMGRDEMO/src/InformationRegisters/ПравилаУчетаВидовЭДДО/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Получает параметры настройки соответствия видов ЭД и видов документов 1С:Документооборот
//
// Парамтеры:
//  ВидЭД - ПеречислениеСсылка.ВидыЭД - Вид электронного документа
//  Организация - СправочникСсылка.Организации - Организация, принимающая документ.
//  Контрагент - СправочникСсылка.Контрагенты - Контрагент, с которым ведется ЭДО.
Функция ПараметрыДокументаПоВидуЭД(ВидЭД, Организация, Контрагент, ТипЭД = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидЭД", ВидЭД);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТипЭД", ТипЭД);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПравилаУчетаВидовЭДДО.ВидДокумента КАК ВидДокумента,
		|	ПравилаУчетаВидовЭДДО.Шаблон КАК Шаблон,
		|	ПравилаУчетаВидовЭДДО.Ответственный КАК Ответственный,
		|	ПравилаУчетаВидовЭДДО.Папка КАК Папка,
		|	ПравилаУчетаВидовЭДДО.ВопросДеятельности КАК ВопросДеятельности,
		|	ПравилаУчетаВидовЭДДО.ШаблонНаименования КАК ШаблонНаименования,
		|	ПравилаУчетаВидовЭДДО.ШаблонСодержания КАК ШаблонСодержания
		|ИЗ
		|	РегистрСведений.ПравилаУчетаВидовЭДДО КАК ПравилаУчетаВидовЭДДО
		|ГДЕ
		|	ПравилаУчетаВидовЭДДО.ВидЭД = &ВидЭД
		|	И ПравилаУчетаВидовЭДДО.Контрагент = &Контрагент
		|	И ПравилаУчетаВидовЭДДО.Организация = &Организация
		|	И ПравилаУчетаВидовЭДДО.Принимать";
	
	Если ЗначениеЗаполнено(ТипЭД) Тогда
		ТекстЗапроса = ТекстЗапроса + " И ПравилаУчетаВидовЭДДО.ТипЭД = &ТипЭД";
	КонецЕсли;
	
	ПараметрыДокументаПоВидуЭД = Новый Структура;
	ПараметрыДокументаПоВидуЭД.Вставить("ВидДокумента");
	ПараметрыДокументаПоВидуЭД.Вставить("Шаблон");
	ПараметрыДокументаПоВидуЭД.Вставить("Ответственный");
	ПараметрыДокументаПоВидуЭД.Вставить("Папка");
	ПараметрыДокументаПоВидуЭД.Вставить("ВопросДеятельности");
	ПараметрыДокументаПоВидуЭД.Вставить("ШаблонНаименования");
	ПараметрыДокументаПоВидуЭД.Вставить("ШаблонСодержания");
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыДокументаПоВидуЭД, Выборка);
	КонецЕсли;
	
	Возврат ПараметрыДокументаПоВидуЭД;
	
КонецФункции

Функция НастройкиПриемаДокументов(Организация, Контрагент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	
	ВходящиеДокументы = Новый ТаблицаЗначений;
	
	ВходящиеДокументы.Колонки.Добавить("Организация"        , Метаданные.ОпределяемыеТипы.Организация.Тип);
	ВходящиеДокументы.Колонки.Добавить("Контрагент"         , Метаданные.ОпределяемыеТипы.УчастникЭДО.Тип);
	ВходящиеДокументы.Колонки.Добавить("ВидЭД"              , Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЭД"));
	ВходящиеДокументы.Колонки.Добавить("ТипЭД"              , Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЭД"));
	
	ВходящиеДокументы.Колонки.Добавить("Принимать"          , ОписаниеТипаБулево);
	ВходящиеДокументы.Колонки.Добавить("ВидДокумента"       , Новый ОписаниеТипов("СправочникСсылка.ВидыВнутреннихДокументов"));
	ВходящиеДокументы.Колонки.Добавить("ВопросДеятельности" , Новый ОписаниеТипов("СправочникСсылка.ВопросыДеятельности"));
	ВходящиеДокументы.Колонки.Добавить("Ответственный"      , Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ВходящиеДокументы.Колонки.Добавить("Папка"              , Новый ОписаниеТипов("СправочникСсылка.ПапкиВнутреннихДокументов"));
	ВходящиеДокументы.Колонки.Добавить("Шаблон"             , Новый ОписаниеТипов("СправочникСсылка.ШаблоныВнутреннихДокументов"));
	ВходящиеДокументы.Колонки.Добавить("ШаблонНаименования" , ОписаниеТипаСтрока);
	ВходящиеДокументы.Колонки.Добавить("ШаблонСодержания"   , ОписаниеТипаСтрока);
	
	АктуальныеВидыЭД = Новый Соответствие;
	ОбменСКонтрагентамиПереопределяемый.ПолучитьАктуальныеВидыЭД(АктуальныеВидыЭД);
	
	НастройкаПоУмолчанию = Новый Структура;
	НастройкаПоУмолчанию.Вставить("Организация"        , Организация);
	НастройкаПоУмолчанию.Вставить("Контрагент"         , Контрагент);
	НастройкаПоУмолчанию.Вставить("Принимать"          , Ложь);
	НастройкаПоУмолчанию.Вставить("ВидДокумента"       , Неопределено);
	НастройкаПоУмолчанию.Вставить("ВопросДеятельности" , Неопределено);
	НастройкаПоУмолчанию.Вставить("Ответственный"      , Неопределено);
	НастройкаПоУмолчанию.Вставить("Шаблон"             , Неопределено);
	НастройкаПоУмолчанию.Вставить("ШаблонНаименования" , "");
	НастройкаПоУмолчанию.Вставить("ШаблонСодержания"   , "");
	
	Для Каждого Элемент Из АктуальныеВидыЭД Цикл
		
		ВидЭД = Элемент.Ключ;
		
		Если ВидЭД = Перечисления.ВидыЭД.ТОРГ12Покупатель
			ИЛИ ВидЭД = Перечисления.ВидыЭД.ВозвратТоваровМеждуОрганизациями 
			ИЛИ ВидЭД = Перечисления.ВидыЭД.АктЗаказчик 
			ИЛИ ВидЭД = Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиПолучатель Тогда
			
			Продолжить;
		КонецЕсли;
		
		Если ВидЭД <> Перечисления.ВидыЭД.ПроизвольныйЭД Тогда
			
			НоваяСтрока = ВходящиеДокументы.Добавить();
			НоваяСтрока.ВидЭД = ВидЭД;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НастройкаПоУмолчанию);
			
		Иначе
			Для Каждого ТипЭД Из Перечисления.ТипыЭД Цикл
				
				НоваяСтрока = ВходящиеДокументы.Добавить();
				НоваяСтрока.ВидЭД = ВидЭД;
				НоваяСтрока.ТипЭД = ТипЭД;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НастройкаПоУмолчанию);
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПравилаУчетаВидовЭДДО.ВидЭД КАК ВидЭД,
		|	ПравилаУчетаВидовЭДДО.ТипЭД КАК ТипЭД,
		|	ПравилаУчетаВидовЭДДО.ВидДокумента КАК ВидДокумента,
		|	ПравилаУчетаВидовЭДДО.ВопросДеятельности КАК ВопросДеятельности,
		|	ПравилаУчетаВидовЭДДО.Ответственный КАК Ответственный,
		|	ПравилаУчетаВидовЭДДО.Папка КАК Папка,
		|	ПравилаУчетаВидовЭДДО.Шаблон КАК Шаблон,
		|	ПравилаУчетаВидовЭДДО.ШаблонНаименования КАК ШаблонНаименования,
		|	ПравилаУчетаВидовЭДДО.ШаблонСодержания КАК ШаблонСодержания,
		|	ПравилаУчетаВидовЭДДО.Принимать КАК Принимать
		|ИЗ
		|	РегистрСведений.ПравилаУчетаВидовЭДДО КАК ПравилаУчетаВидовЭДДО
		|ГДЕ
		|	ПравилаУчетаВидовЭДДО.Организация = &Организация
		|	И ПравилаУчетаВидовЭДДО.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	ВыборкаЗаписанных = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗаписанных.Следующий() Цикл
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("ВидЭД", ВыборкаЗаписанных.ВидЭД);
		ОтборСтрок.Вставить("ТипЭД", ВыборкаЗаписанных.ТипЭД);
		
		СтрокиНастроек = ВходящиеДокументы.НайтиСтроки(ОтборСтрок);
		
		Для Каждого Строка Из СтрокиНастроек Цикл
			ЗаполнитьЗначенияСвойств(Строка, ВыборкаЗаписанных);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ВходящиеДокументы;
	
КонецФункции

#КонецОбласти
